[
  {
    "id": 1,
    "title": "And Then There Were None",
    "author": "Agatha Christie",
    "coverImage": "/assets/Images/Book-cover-Images/And_Then_There_Were_None.jpg",
    "description": "And Then There Were None The World's Bestselling Mystery \"Ten . . .\" Ten strangers are lured to an isolated island mansion off the Devon coast by a mysterious \"U. N. Owen.\" \"Nine . . .\" At dinner a recorded message accuses each of them in turn of having a guilty secret, and by the end of the night one of the guests is dead. \"Eight . . .\" Stranded by a violent storm, and haunted by a nursery rhyme counting down one by one . . . as one by one . . . they begin to die. \"Seven . . .\" Which among them is the killer and will any of them survive? ",
    "publishDate": "2011",
    "publisher": "William Morrow Paperbacks",
    "pages": "272",
    "isbn": "9780062073471",
    "subject": "Crime, Thrillers & Mystery - Detective"
  },
  {
    "id": 2,
    "title": "Words That Change Minds",
    "author": "Shelle Rose Charvet",
    "coverImage": "/assets/Images/Book-cover-Images/Words_That_Change_Minds.jpg",
    "description": "Words that Change Minds is based on the Language and Behavior Profile® (LAB Profile® for short) - a powerful tool which illustrates the link between language and behavior. The LAB Profile® will enable you to understand from someone's language in everyday conversation, how they will behave in a given situation. You will learn how to customize your language for specific people and groups to trigger motivation and even change people's minds. ",
    "publishDate": "2019",
    "publisher": "Institute for Influence",
    "pages": "355",
    "isbn": "9781733670302",
    "subject": "Self-Help, Lifestyle, communication"
  },
  {
    "id": 3,
    "title": "The Social Skills Guide Book",
    "author": "Chris Macleod",
    "coverImage": "/assets/Images/Book-cover-Images/The_Social_Skills_Guide_Book.jpg",
    "description": "A comprehensive, down to earth guide on how teens and adults can improve their core interpersonal skills. Covers managing shyness and anxiety, making conversation, and forming friendships. The author runs one of the web's largest sites on social skills, and is a trained counselor.",
    "publishDate": "2016",
    "publisher": "Chris MacLeod",
    "pages": "364",
    "isbn": "9780994980700",
    "subject": "Self-Help, Relationships, Lifestyle"
  },
  {
    "id": 4,
    "title": "The Wicked King",
    "author": "Holly Black",
    "coverImage": "/assets/Images/Book-cover-Images/The_Wicked_King.jpg",
    "description": "The enchanting and bloodthirsty sequel to the New York Times bestselling novel The Cruel Prince. You must be strong enough to strike and strike and strike again without tiring. The first lesson is to make yourself strong. After the jaw-dropping revelation that Oak is the heir to Faerie, Jude must keep her brother safe. To do so, she has bound the wicked king, Cardan, to her, and made herself the power behind the throne. Navigating the constantly shifting political alliances of Faerie would be difficult enough if Cardan were easy to control. But he does everything in his power to humiliate and undermine her even as his fascination with her remains undiminished. When it becomes all too clear that someone close to Jude means to betray her, threatening her own life and the lives of everyone she loves, Jude must uncover the traitor and fight her own complicated feelings for Cardan to maintain control as a mortal in a Faerie world. ",
    "publishDate": "2019",
    "publisher": "Little, Brown Books for Young Readers",
    "pages": "369",
    "isbn": "9780316310338",
    "subject": "Romance - Fantasy"
  },
  {
    "id": 5,
    "title": "The Queen of Nothing",
    "author": "Holly Black",
    "coverImage": "/assets/Images/Book-cover-Images/The_Queen_of_Nothing.jpg",
    "description": "A powerful curse forces the exiled Queen of Faerie to choose between ambition and humanity in this highly anticipated and jaw-dropping finale to The Folk of the Air trilogy from a #1 New York Times bestselling author. He will be the destruction of the crown and the ruination of the throne Power is much easier to acquire than it is to hold onto. Jude learned this lesson when she released her control over the wicked king, Cardan, in exchange for immeasurable power. Now as the exiled mortal Queen of Faerie, Jude is powerless and left reeling from Cardan's betrayal. She bides her time determined to reclaim everything he took from her. Opportunity arrives in the form of her twin sister, Taryn, whose life is in peril. Jude must risk venturing back into the treacherous Faerie Court, and confront her lingering feelings for Cardan, if she wishes to save her sister. But Elfhame is not as she left it. War is brewing. As Jude slips deep within enemy lines she becomes ensnared in the conflict's bloody politics. And, when a dormant yet powerful curse is unleashed, panic spreads throughout the land, forcing her to choose between her ambition and her humanity . . .  ",
    "publishDate": "2019",
    "publisher": "Hachette UK",
    "pages": "279",
    "isbn": "9780316310406",
    "subject": "Fiction - Contemporary Fiction"
  },
  {
    "id": 6,
    "title": "Python for Data Analysis",
    "author": "Wes McKinney",
    "coverImage": "/assets/Images/Book-cover-Images/Python_for_Data_Analysis.jpg",
    "description": "Get complete instructions for manipulating, processing, cleaning, and crunching datasets in Python. Updated for Python 3.6, the second edition of this hands-on guide is packed with practical case studies that show you how to solve a broad set of data analysis problems effectively. You'll learn the latest versions of pandas, NumPy, IPython, and Jupyter in the process.Written by Wes McKinney, the creator of the Python pandas project, this book is a practical, modern introduction to data science tools in Python. It's ideal for analysts new to Python and for Python programmers new to data science and scientific computing. Data files and related material are available on GitHub.",
    "publishDate": "2017",
    "publisher": "O'Reilly Media",
    "pages": "544",
    "isbn": "9781491957660",
    "subject": "Computers - Databases"
  },
  {
    "id": 7,
    "title": "Pride And Prejudice",
    "author": "Jane Austen",
    "coverImage": "/assets/Images/Book-cover-Images/Price_And_Prejudice.jpg",
    "description": "Pride and Prejudice is the second novel by English author Jane Austen, published in 1813. A novel of manners, it follows the character development of Elizabeth Bennet, the protagonist of the book, who learns about the repercussions of hasty judgments and comes to appreciate the difference between superficial goodness and actual goodness.",
    "publishDate": "2004",
    "publisher": "Barnes Noble Classics",
    "pages": "-",
    "isbn": "9780237525804",
    "subject": "Fiction - Classics"
  },
  {
    "id": 8,
    "title": "All Rhodes Leads Here",
    "author": "Mariana Zapata",
    "coverImage": "/assets/Images/Book-cover-Images/All_Rhodes_Lead_Here.jpg",
    "description": "Aurora De La Torre knows moving back to a place that was once home isn't going to be easy. Starting your whole life over probably isn't supposed to be.But a small town in the mountains might be the perfect remedy for a broken heart.Checking out her landlord across the driveway just might cure it too. ",
    "publishDate": "2021",
    "publisher": "Independently",
    "pages": "570",
    "isbn": "9781953262011",
    "subject": "Romance - Contemporary Romance"
  },
  {
    "id": 9,
    "title": "The Lightning Thief",
    "author": "Rick Riordan",
    "coverImage": "/assets/Images/Book-cover-Images/The_Lightning_Thief.jpg",
    "description": "Rick Riordan is the #1 New York Times bestselling author of the Percy Jackson and the Olympians series, the Kane Chronicles, the Heroes of Olympus, and Magnus Chase and the Gods of Asgard.  ",
    "publishDate": "2005",
    "publisher": "Penguin Books Ltd (UK)",
    "pages": "-",
    "isbn": "-",
    "subject": "Crime, Thrillers & Mystery"
  },
  {
    "id": 10,
    "title": "The Roommate",
    "author": "Rosie Danan",
    "coverImage": "/assets/Images/Book-cover-Images/The_Roommate.jpg",
    "description": "Do your own dishes. Knock before entering the bathroom. Never look up your roommate online. The Wheatons are infamous among the east coast elite for their lack of impulse control, except for their daughter Clara. She's the consummate socialite: over-achieving, well-mannered, predictable. But every Wheaton has their weakness. When Clara's childhood crush invites her to move cross-country, the offer is too much to resist. Unfortunately, it's also too good to be true. After a bait-and-switch, Clara finds herself sharing a lease with a charming stranger. Josh might be a bit too perceptive—not to mention handsome—for comfort, but there's a good chance he and Clara could have survived sharing a summer sublet if she hadn't looked him up on the Internet... Once she learns how Josh has made a name for himself, Clara realizes living with him might make her the Wheaton's most scandalous story yet. His professional prowess inspires her to take tackling the stigma against female desire into her own hands. They may not agree on much, but Josh and Clara both believe women deserve better sex. What they decide to do about it will change both of their lives, and if they're lucky, they'll help everyone else get lucky too.",
    "publishDate": "2021",
    "publisher": "Penguin Pub Group",
    "pages": "335",
    "isbn": "9780593101612",
    "subject": "Romance - Contemporary Romance"
  },
  {
    "id": 11,
    "title": "The Play",
    "author": "Elle Kennedy",
    "coverImage": "/assets/Images/Book-cover-Images/The_Play.jpg",
    "description": "What I learned after last year's distractions cost my hockey team our entire season? No more screwing up. No more screwing, period. As the new team captain, I need a new philosophy: hockey and school now, women later. Which means that I, Hunter Davenport, am officially going celibate…no matter how hard that makes things.But there's nothing in the rulebook that says I can't be friends with a woman. And I won't lie—my new classmate Demi Davis is one cool chick. Her smart mouth is hot as hell, and so is the rest of her, but the fact that she's got a boyfriend eliminates the temptation to touch her. Except three months into our friendship, Demi is single and looking for a rebound.And she's making a play for me. Avoiding her is impossible. We're paired up on a yearlong school project, but I'm confident I can resist her. We'd never work, anyway. Our backgrounds are too different, our goals aren't aligned, and her parents hate my guts.Hooking up is a very bad idea. Now I just have to convince my body—and my heart.",
    "publishDate": "2018",
    "publisher": "Elle Kennedy Inc.",
    "pages": "422",
    "isbn": "B07NF2BDFZ",
    "subject": "Romance - Contemporary Romance"
  },
  {
    "id": 12,
    "title": "Punk 57",
    "author": "Penelope Douglas",
    "coverImage": "/assets/Images/Book-cover-Images/Punk_57.jpg",
    "description": "We were perfect together. Until we met.\n\nMisha\n\nI can’t help but smile at the words in her letter. She misses me.\n\nIn fifth grade, my teacher set us up with pen pals from a different school. Thinking I was a girl, with a name like Misha, the other teacher paired me up with her student, Ryen. My teacher, believing Ryen was a boy like me, agreed.\n\nIt didn’t take long for us to figure out the mistake. And in no time at all, we were arguing about everything. The best take-out pizza. Android vs. iPhone. Whether or not Eminem is the greatest rapper ever…\n\nAnd that was the start. For the next seven years, it was us.\n\nHer letters are always on black paper with silver writing. Sometimes there’s one a week or three in a day, but I need them. She’s the only one who keeps me on track, talks me down, and accepts everything I am.\n\nWe only had three rules. No social media, no phone numbers, no pictures. We had a good thing going. Why ruin it?\n\nUntil I run across a photo of a girl online. Name’s Ryen, loves Gallo’s pizza, and worships her iPhone. What are the chances?\n\nF*ck it. I need to meet her.\n\nI just don’t expect to hate what I find.\n\nRyen\n\nHe hasn’t written in three months. Something’s wrong. Did he die? Get arrested? Knowing Misha, neither would be a stretch.\n\nWithout him around, I’m going crazy. I need to know someone is listening. It’s my own fault. I should've gotten his number or picture or something.\n\nHe could be gone forever.\n\nOr right under my nose, and I wouldn’t even know it.",
    "publishDate": "2016",
    "publisher": "Createspace Independent Publishing ",
    "pages": "342",
    "isbn": "9781552674710",
    "subject": "Romance - Contemporary Romance"
  },
  {
    "id": 13,
    "title": "The Chase",
    "author": "Elle Kennedy",
    "coverImage": "/assets/Images/Book-cover-Images/The_Chase.jpg",
    "description": "Everyone says opposites attract. And they must be right, because there’s no logical reason why I’m so drawn to Colin Fitzgerald. I don’t usually go for tattoo-covered, video-gaming, hockey-playing nerd-jocks who think I’m flighty and superficial. His narrow view of me is the first strike against him. It doesn’t help that he’s buddy-buddy with my brother.\n\nAnd that his best friend has a crush on me.\n\nAnd that I just moved in with them.\n\nOh, did I not mention we’re roommates?\n\nI suppose it doesn’t matter. Fitzy has made it clear he’s not interested in me, even though the sparks between us are liable to burn our house down. I’m not the kind of girl who chases after a man, though, and I’m not about to start. I’ve got my hands full dealing with a new school, a sleazy professor, and an uncertain future. So if my sexy brooding roomie wises up and realizes what he’s missing?\n\nHe knows where to find me.",
    "publishDate": "2018",
    "publisher": "Elle Kennedy Inc.",
    "pages": "347",
    "isbn": "9788501037121",
    "subject": "Romance - Contemporary Romance"
  },
  {
    "id": 14,
    "title": "Think And Grow Rich",
    "author": "Napoleon Hill",
    "coverImage": "/assets/Images/Book-cover-Images/Think_And_Grow_Rich.jpg",
    "description": "Napoleon Hill, America's most beloved motivational author, devoted 25 years to finding out how the wealthy became that way. After interviewing over 500 of the most affluent men and women of his time, he uncovered the secret to great wealth based on the no ",
    "publishDate": "2004",
    "publisher": "Random House",
    "pages": "322",
    "isbn": "9780091900212",
    "subject": "Business & Economics"
  },
  {
    "id": 15,
    "title": "Fluent English",
    "author": "Living Language",
    "coverImage": "/assets/Images/Book-cover-Images/Fluent_English.jpg",
    "description": "ESL (English as a Second Language) students who reach an intermediate level of English don’t need endless drills in grammar or tedious vocabulary lists; they need to learn how to make their English sound natural. Fluent English is the ideal course for developing native-like fluency in English. It focuses on the essentials—idiomatic expressions, phrasal verbs, practical vocabulary expansion, and grammar usage in context—and builds listening comprehension as well as pronunciation and intonation skills. ",
    "publishDate": "2006",
    "publisher": "Random House.",
    "pages": "233",
    "isbn": "9781400020881",
    "subject": "Languages"
  }
]
